const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', () => {
  expect(sum(20,1)).toBe(21);
})

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7', () => {
  expect(sum(2,5)).toBe(7)
})
// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
test('20 + 20 เท่ากับ 40', ()=> {
    expect(sum(20,20)).toBe(40)
})
test('-100 + 50 เท่ากับ -50',()=> {
    expect(sum(-100,50)).toBe(-50)
})
test('100 - 100 เท่ากับ 0',()=> {
    expect(sum(-100,100)).toBe(0)
})
